In [1]:
class Car():
    pass

van = Car()
sedan = Car()
# all the objects derived from a class works in different memory address
print(van)
print(sedan)

<__main__.Car object at 0x104ea1fc0>
<__main__.Car object at 0x104ea2140>

In [2]:
# functions are called as methods in class
# they contain default parameter called self (self contains the memory address of an object)

class Car():
    def tyres(self):
        print("i have 4 tyres")
        
obj = Car()
obj.tyres()

i have 4 tyres

In [3]:
class Car():
    def tyres(self, num):
        print("i have", num, "tyres")
        
    def color(self, c):
        print("my color is ", c)
        
obj = Car()
obj.tyres(4)
obj.color("RED")

i have 4 tyres
my color is  RED

In [4]:
# constructors are autoexecutable methods that get invoked automatically as soon 
# as object is created

class Car():
    def __init__(self):
        print("i am constructor")
        
obj1 = Car()
obj2 = Car()

i am constructor
i am constructor

In [6]:
class Car():
    def tyres(self, num):
        print("i have", num, "tyres")
        
    def color(self, c, num):
        print("my color is ", c, "and i have", num, "tyres")
        
obj = Car()
obj.tyres(4)
obj.color("RED", 4)

i have 4 tyres
my color is  RED and i have 4 tyres

In [7]:
class Car():
    def __init__(self, num, c):
        self.num = num # self.num is an object variable 
        self.c = c
        
    def tyres(self):
        print("i have", self.num, "tyres")
        
    def color(self):
        print("my color is ", self.c, "and i have", self.num, "tyres")
        
obj = Car(4, "RED")
obj.tyres()
obj.color()

i have 4 tyres
my color is  RED and i have 4 tyres

In [ ]:
'''
create class circle in which take input radius in constructor
and in area method find area and in perimeter method find perimeter of circle

create class list_manipulation, in which take input elements of a list one by one
till user enters -999
in find_outlier method find the outlier in that list. use any of the methods 
3 Standard Deviation  technique (3 SD) or Inter Quartile Range (IQR) method
'''

import numpy as np

class list_manipulation():

  lst = []

  def __init__(self):

    STOP = '-999'

    self.lst = list(iter(input, STOP))

 

  def printList(self):

    print("Input list is: ",self.lst)

 

  def find_outlier(self):

    l1 = [eval(i) for i in self.lst]

    elements = np.array(l1)
    avg = np.mean(elements, axis=0)
    sd = np.std(elements, axis=0)
    final_list = [x for x in l1 if (x > avg - 3 * sd)]
    final_list = [x for x in final_list if (x < avg + 3 * sd)]
    print("Final list is: ", final_list)

 

obj = list_manipulation()
obj.printList()
obj.find_outlier()
has context menu
Compose

In [ ]:
import math

class Circle():

  def __init__(self, r):

    self.r = r

 

  def area(self):

    a = math.pi*self.r**2

    print("Area is: ", a)

 

  def perimeter(self):

    p = 2*math.pi*self.r

    print("Perimeter is: ", p)

 

rad = float(input("Please enter the radius: "))
obj = Circle(rad)
obj.area()
obj.perimeter()

In [ ]:
# pandas is a library for data analytics
# series (contains single dimentional data) and dataframes contains (2 dimentional data)

In [8]:
d={'name':['amit','sumit','suman','john'], 'age':[22,33,43,48], 'salary':[3000,4000,5000,6000]}

In [10]:
# keys of dictionary become column headings
import pandas
df = pandas.DataFrame(d)
df

    name  age  salary
0   amit   22    3000
1  sumit   33    4000
2  suman   43    5000
3   john   48    6000

In [11]:
df.describe() # basic statistical information of all numerical columns

             age       salary
count   4.000000     4.000000
mean   36.500000  4500.000000
std    11.503623  1290.994449
min    22.000000  3000.000000
25%    30.250000  3750.000000
50%    38.000000  4500.000000
75%    44.250000  5250.000000
max    48.000000  6000.000000

In [ ]:
# in pandas, string column is stored as an object
# if the column is having all integers - datatype of that column will be integer
# if the column is having all integers and single missing value is there, datatype will be float
# missing values are called NaN => not a applicable value or missing value

In [12]:
df = pandas.read_csv(r'/Users/abhaya/Desktop/Day 3/feedback1.csv')
df

  Last Name           First_Name              Rating  hours  Price
0                 NaN            Gandhali  excellent   10.0   1000
1               Gadde              Kavita  excellent    2.0   2000
2                 NaN             gowtham       good   30.0   3000
3              Hassan                 NaN        NaN   10.0   2000
4               Kumar             Parveen  excellent    NaN   2200
5               Gupta             Sanjeev  excellent   11.0   2233
6          ramalingam          lakshmanan    average   23.0   1232
7                 NaN           Venkatesh  excellent   18.0   1899
8               Kumar                Amit  excellent   22.0   1919
9                Jain              Sudhir       good   11.0    122

In [13]:
df.dtypes

Last Name               object
First_Name              object
Rating                  object
hours                  float64
Price                    int64
dtype: object

In [14]:
df.columns # name of the columns

Index(['Last Name          ', 'First_Name         ', 'Rating', 'hours',
       'Price'],
      dtype='object')

In [15]:
df.columns = df.columns.str.strip()
df.columns

Index(['Last Name', 'First_Name', 'Rating', 'hours', 'Price'], dtype='object')

In [16]:
df.shape # rows Vs columns

(10, 5)

In [ ]:
# 3 important things you must after reading data in dataframe
# df.shape
# df.columns
# df.dtypes

In [17]:
df

    Last Name  First_Name     Rating  hours  Price
0         NaN    Gandhali  excellent   10.0   1000
1       Gadde      Kavita  excellent    2.0   2000
2         NaN     gowtham       good   30.0   3000
3      Hassan         NaN        NaN   10.0   2000
4       Kumar     Parveen  excellent    NaN   2200
5       Gupta     Sanjeev  excellent   11.0   2233
6  ramalingam  lakshmanan    average   23.0   1232
7         NaN   Venkatesh  excellent   18.0   1899
8       Kumar        Amit  excellent   22.0   1919
9        Jain      Sudhir       good   11.0    122

In [18]:
# when we want to fetch column use . when column name is one word
# when we have spaces in column name we use []
df.First_Name

0      Gandhali
1        Kavita
2       gowtham
3           NaN
4       Parveen
5       Sanjeev
6    lakshmanan
7     Venkatesh
8          Amit
9        Sudhir
Name: First_Name, dtype: object

In [19]:
df['Last Name']

0           NaN
1         Gadde
2           NaN
3        Hassan
4         Kumar
5         Gupta
6    ramalingam
7           NaN
8         Kumar
9          Jain
Name: Last Name, dtype: object

In [20]:
# for giving conditions we use ()
# i want to fetch all the people who gave excellent rating
df[(df.Rating == 'excellent')]

  Last Name First_Name     Rating  hours  Price
0       NaN   Gandhali  excellent   10.0   1000
1     Gadde     Kavita  excellent    2.0   2000
4     Kumar    Parveen  excellent    NaN   2200
5     Gupta    Sanjeev  excellent   11.0   2233
7       NaN  Venkatesh  excellent   18.0   1899
8     Kumar       Amit  excellent   22.0   1919

In [23]:
# i want to fetch all the people who gave excellent rating and paid more than 2000 Rs
df[(df.Rating == 'excellent') & (df.Price>2000)].First_Name

4    Parveen
5    Sanjeev
Name: First_Name, dtype: object

In [24]:
df[(df.Rating == 'excellent') & (df.Price>2000)][['First_Name', 'Last Name']]

  First_Name Last Name
4    Parveen     Kumar
5    Sanjeev     Gupta

In [25]:
df

    Last Name  First_Name     Rating  hours  Price
0         NaN    Gandhali  excellent   10.0   1000
1       Gadde      Kavita  excellent    2.0   2000
2         NaN     gowtham       good   30.0   3000
3      Hassan         NaN        NaN   10.0   2000
4       Kumar     Parveen  excellent    NaN   2200
5       Gupta     Sanjeev  excellent   11.0   2233
6  ramalingam  lakshmanan    average   23.0   1232
7         NaN   Venkatesh  excellent   18.0   1899
8       Kumar        Amit  excellent   22.0   1919
9        Jain      Sudhir       good   11.0    122

In [26]:
# i want to find who paid max price
df[(df.Price == df.Price.max())]

  Last Name First_Name Rating  hours  Price
2       NaN    gowtham   good   30.0   3000

In [3]:
# sort based on price in descending order and fetch the top row
df.sort_values(by='Price', ascending=False).head(1)

NameError: name 'df' is not defined